<!-- dflook/terraform-github-actions {"workspace":"default","backend":"0936237575959a4ba7dae896124b8cfe3d1dcca4dfb0f017ac2bb33f79ee4e94","backend_type":"s3"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_network_interface.bastion[0] will be updated in-place
  ~ resource "aws_network_interface" "bastion" {
        id                        = "eni-044e380fe8cb474a9"
      ~ security_groups           = [
          - "sg-0ddc0c90ef47bb160",
        ] -> (known after apply)
        tags                      = {
            "Name" = "primary_network_interface"
        }
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.this must be replaced
-/+ resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:eu-west-2:664944010770:security-group/sg-0f440099228dd752c" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "********************" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "private" -> "cassandra" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "************" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-f2a8dc9a" -> "vpc-0217d99fdccab00ee" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_all must be replaced
-/+ resource "aws_security_group_rule" "allow_all" {
      ~ id                       = "*****************" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "********************" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.ssh will be created
  + resource "aws_security_group_rule" "ssh" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [terraform #43](https://github.com/hybridaccess/aws-infra/actions/runs/2484563134)